In [1]:
import pandas as pd

#criar series com uma lista

series1 = pd.Series([1,2,3,4])
series1

0    1
1    2
2    3
3    4
dtype: int64

In [2]:
#index da series
series1.index
list(series1.index)

[0, 1, 2, 3]

In [3]:
#Criar Series com um dict

series2 = pd.Series(
    {
      "a":1,
     "b":2,
     "c":3,
     "d":4
     }
    )
series2

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
#index da Series com dict
series2.index
lista = list(series2.index)
lista

['a', 'b', 'c', 'd']

In [5]:
#ler arquivo CSV
cols = ["longitude"	,"latitude","housing_median_age","population","median_income"]
arquivo = "../../datasets/california_housing_train.csv"

df = pd.read_csv(
    arquivo,
    usecols=cols
)
df.head(10)

   longitude  latitude  housing_median_age  population  median_income
0    -114.31     34.19                15.0      1015.0         1.4936
1    -114.47     34.40                19.0      1129.0         1.8200
2    -114.56     33.69                17.0       333.0         1.6509
3    -114.57     33.64                14.0       515.0         3.1917
4    -114.57     33.57                20.0       624.0         1.9250
5    -114.58     33.63                29.0       671.0         3.3438
6    -114.58     33.61                25.0      1841.0         2.6768
7    -114.59     34.83                41.0       375.0         1.7083
8    -114.59     33.61                34.0      3134.0         2.1782
9    -114.60     34.83                46.0       787.0         2.1908

In [6]:
#index, coluna e shape do dataframe
df.shape[1]

5

In [7]:
#head e info do DF
df.info()
df.describe()

<class 'pandas.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   population          17000 non-null  float64
 4   median_income       17000 non-null  float64
dtypes: float64(5)
memory usage: 664.2 KB

,longitude,latitude,housing_median_age,population,median_income
count,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000
mean,-119.562108,35.625225,28.589353,1429.573941,3.883578
std,2.005166,2.137340,12.586937,1147.852959,1.908157
min,-124.350000,32.540000,1.000000,3.000000,0.499900
25%,-121.790000,33.930000,18.000000,790.000000,2.566375
50%,-118.490000,34.250000,29.000000,1167.000000,3.544600
75%,-118.000000,37.720000,37.000000,1721.000000,4.767000
max,-114.310000,41.950000,52.000000,35682.000000,15.000100

In [ ]:
#vamos baixar o dataset dos filmes do james bond
# !wget --no-check-certificate 'https://drive.google.com/uc?export=download&id=1VhSehwUQBM_j27hbpCJwhnSQYtap0nCF' -O jamesbond.csv

'wget' n�o � reconhecido como um comando interno
ou externo, um programa oper�vel ou um arquivo em lotes.
'id' n�o � reconhecido como um comando interno
ou externo, um programa oper�vel ou um arquivo em lotes.

In [9]:
#ler csv do jamesbond
path_arquivo_bond = "../../datasets/jamesbond.csv"

df = pd.read_csv(
    path_arquivo_bond,
)
df

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
5,You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
6,On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
7,Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
8,Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
9,The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,NaN
10,The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,NaN
11,Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN
12,For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
13,Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN
14,Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8
15,A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
16,The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2
17,Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
18,GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
19,Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10.0
20,The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13.5
21,Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
22,Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
23,Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8.1
24,Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
25,Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,30.0
26,No Time to Die,2021,Daniel Craig,Cary Joji Fukunaga,774.2,301.0,25.0

In [10]:
#iloc com um número e uma slice
df.iloc[0:10]

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
5,You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
6,On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
7,Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
8,Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
9,The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,NaN

In [11]:
df2 = df.set_index("Film")
df2.loc["Dr. No"]

#ler o CSV e já colocar a coluna como index

df_bond = pd.read_csv(
    path_arquivo_bond,
    index_col="Film"
)
df_bond.head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [12]:
#.loc com o nome do index (str)
df2.loc["Dr. No"]

Year                          1962
Actor                 Sean Connery
Director             Terence Young
Box Office                   448.8
Budget                         7.0
Bond Actor Salary              0.6
Name: Dr. No, dtype: object

In [13]:
#.loc com uma lista de indexes
df2.loc["Dr. No":"Goldfinger"]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [14]:
#.loc com slice
df2.loc["Dr. No":"Goldfinger"]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [15]:
#.at para acessar e modificar valores
df2.at["Dr. No","Actor"] = "Sir Sean Connery"
df2.loc["Dr. No"]

Year                             1962
Actor                Sir Sean Connery
Director                Terence Young
Box Office                      448.8
Budget                            7.0
Bond Actor Salary                 0.6
Name: Dr. No, dtype: object

In [16]:
#filtrar dataframe pelas linhas onde os atores são: "Sean Connery" ou  "Sir Sean Connery"

serie_bool1  = df2["Actor"] == "Sean Connery"
serie_bool2  = df2["Actor"] == "Sir Sean Connery"

serie_bool3 = serie_bool1 | serie_bool2

df2[serie_bool3]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sir Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN

In [17]:
# acessar a coluna "Bond Actor Salary" e usar os métodos .mean() , max() , std()


df2["Bond Actor Salary"].count()
df2.shape[0]

27

In [18]:
# acessar a coluna "Actor" e usar value_counts()
df2["Actor"].value_counts()

Actor
Roger Moore         7
Sean Connery        6
Daniel Craig        5
Pierce Brosnan      4
Timothy Dalton      2
Sir Sean Connery    1
David Niven         1
George Lazenby      1
Name: count, dtype: int64

In [19]:
#Exercicio de Merge/Join

# Listas de frutas e seus países de origem
frutas = ["Maçã", "Laranja", "Ameixa", "Uva", "Mirtilo", "Melancia"]
paises_frutas = ["Brasil", "Espanha", "Portugal", "Itália", "EUA", "Brasil"]

df_frutas = pd.DataFrame({'Fruta': frutas, 'País': paises_frutas})

esportes = ["Futebol", "Basquete", "Vôlei", "Tênis", "Natação"]
paises_esportes = ["Brasil", "EUA", "Brasil", "França", "EUA"]

# Criando DataFrame de esportes
df_esportes = pd.DataFrame({'Esporte': esportes, 'País': paises_esportes})

In [20]:
#inner join

joined_df = df_esportes.merge(
    df_frutas,
    on="País",
    how="inner"
)

joined_df

    Esporte    País     Fruta
0   Futebol  Brasil      Maçã
1   Futebol  Brasil  Melancia
2  Basquete     EUA   Mirtilo
3     Vôlei  Brasil      Maçã
4     Vôlei  Brasil  Melancia
5   Natação     EUA   Mirtilo

In [21]:
#outer join

joined_df = df_esportes.merge(
    df_frutas,
    on="País",
    how="outer"
)
joined_df

    Esporte      País     Fruta
0   Futebol    Brasil      Maçã
1   Futebol    Brasil  Melancia
2     Vôlei    Brasil      Maçã
3     Vôlei    Brasil  Melancia
4  Basquete       EUA   Mirtilo
5   Natação       EUA   Mirtilo
6       NaN   Espanha   Laranja
7     Tênis    França       NaN
8       NaN    Itália       Uva
9       NaN  Portugal    Ameixa

In [22]:
#groupby Actor

agrupamento_ator = df2.groupby("Actor")
agrupamento_ator

In [23]:
#acessar coluna "Bond Actor Salary" do groupby e usar as func de aggregação .mean(), .max() e .count()
agrupamento_ator["Bond Actor Salary"].count()

Actor
Daniel Craig        5
David Niven         0
George Lazenby      1
Pierce Brosnan      4
Roger Moore         2
Sean Connery        5
Sir Sean Connery    1
Timothy Dalton      2
Name: Bond Actor Salary, dtype: int64